[{"year":"2010","events":["Gran premio Segunda Bienal de Diseño del mueble Universidad Veritas."]},{"year":"2008","events":["Museo del Diseño Euromobilia."]},{"year":"2007","events":["Dos Maderas /Dos visiones. Museo de Arte y Diserto Contemporáneo."]},{"year":"2005","events":["Uno ve lo que sabe. Centro Cultural de España","Bosque Mar, Punta Islita."]},{"year":"2003","events":["“Playing With Light and Shadow”, </br>Centro Cultural Costarricense Norteamericano. Conjunta con Loida Pretiz.","Primera Confrontación en el Arte 40 artistas 4 curadores, </br>Galería Nacional Museo de los Niños"]},{"year":"2002","events":["Concurso Kent Explora Espacios (Primer Lugar)"]},{"year":"2001","events":["Contrastes Alternativos. Embajada de Francia en CostaRica"]},{"year":"2000","events":["Bienal Internacional Diseño. Saint Etttenney Francia","Primera Feria Internacional de Artesanía (Fiapri). Puerto Rico.","Juegos de Luz y Sombra. Galería Sophia Wanamaker, </br>Centro Cultural Costarricense Norteamericano."]},{"year":"2001","events":["Contrastes Alternativos. Embajada de Francia en Costa Rica. </br>Múltiple Teorética Arte y Pensamiento. San José, Costa Rica.","28° Muestra Internacional de Artesanía de la Pontificia. </br>Universidad Católica de Chile, Santiago de Chile."]},{"year":"2000","events":["Biennale Internationale Design. Saint-Étienne, Francia.","1ª Feria Internacional de Artesanía (Fiapri 2000). Puerto Rico."]},{"year":"1998","events":["25º  Muestra Internacional de Artesanía de la Pontificia. </br>Universidad Católica de Chile, Santiago de Chile.","8º Muestra Iberoamericana de Artesanía de España y América. Tenerife, España."]},{"year":"1997","events":["Intro-Retro, lndividual Museo de Arte y Diseño Contemporáneo. San José, Costa Rica."]},{"year":"1996","events":["Individual, Galena de Arte José Figueres. </br>Retrospectiva de la Primera Década de la Galería. (1986-1996 colectiva)."]},{"year":"1994","events":["Participación en Washington Gift Show. Washington, USA."]},{"year":"1994","events":["Participación en Washington Gift Show,USA."]},{"year":"1993","events":["Museo de Arte y Artesanía Internacional en Taipéi </br>(selección de obras de los mejores artesanos a nivel mundial), República de China."]},{"year":"1992","events":["Exposición de Sevilla, España."]},{"year":"1991","events":["Hotel San José Palacio, en ocasión de la visita de los Reyes dé España."]}]